---
kind: method
id: M:Autodesk.Revit.DB.NumericRevisionSettings.IsValid
source: html/5ecabad9-7b7f-18f9-04c8-0328f196b113.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.IsValid Method

Determines whether the NumericRevisionSettings object is in a valid state.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the NumericRevisionSettings is valid.

## Remarks
The NumericRevisionSettings should at least contain a non-negative start number.